[Killed] Block removal mutation
lab-2025-i-si784-u2-05-cs-Daleskadf/Bank/Bank.Domain/BankAccount.cs:13:38
         m_customerName = customerName;
         m_balance = balance;
     }
-    public string CustomerName { get { return m_customerName; } }
+    public string CustomerName { get {} }
     public double Balance { get { return m_balance; }  }
     public void Debit(double amount)
killedBy: Bank.Domain.Tests.BankAccountTests.CustomerName_ReturnsCorrectName_AfterConstruction

[Killed] Block removal mutation
lab-2025-i-si784-u2-05-cs-Daleskadf/Bank/Bank.Domain/BankAccount.cs:14:33
         m_balance = balance;
     }
     public string CustomerName { get { return m_customerName; } }
-    public double Balance { get { return m_balance; }  }
+    public double Balance { get {}  }
     public void Debit(double amount)
     {
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_WithValidPositiveAmount_UpdatesBalanceCorrectly; Bank.Domain.Tests.BankAccountTests.Credit_WithValidPositiveAmount_UpdatesBalanceCorrectly; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] Negate expression
lab-2025-i-si784-u2-05-cs-Daleskadf/Bank/Bank.Domain/BankAccount.cs:17:13
     public double Balance { get { return m_balance; }  }
     public void Debit(double amount)
     {
-        if (amount > m_balance)
+        if (!(amount > m_balance))
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
         if (amount < 0)
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRange; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] Equality mutation
lab-2025-i-si784-u2-05-cs-Daleskadf/Bank/Bank.Domain/BankAccount.cs:19:13
     {
         if (amount > m_balance)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
-        if (amount < 0)
+        if (amount > 0)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountLessThanZeroMessage);
         m_balance -= amount; 
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRange; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] Equality mutation
lab-2025-i-si784-u2-05-cs-Daleskadf/Bank/Bank.Domain/BankAccount.cs:25:13
     }
     public void Credit(double amount)
     {
-        if (amount < 0)
+        if (amount > 0)
             throw new ArgumentOutOfRangeException("amount");
         m_balance += amount;
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_WithValidPositiveAmount_UpdatesBalanceCorrectly; Bank.Domain.Tests.BankAccountTests.Credit_WithValidPositiveAmount_UpdatesBalanceCorrectly; Bank.Domain.Tests.BankAccountTests.Credit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRangeException

[Killed] Statement mutation
lab-2025-i-si784-u2-05-cs-Daleskadf/Bank/Bank.Domain/BankAccount.cs:26:13
     public void Credit(double amount)
     {
         if (amount < 0)
-            throw new ArgumentOutOfRangeException("amount");
+            ;
         m_balance += amount;
     }
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRangeException

[Killed] String mutation
lab-2025-i-si784-u2-05-cs-Daleskadf/Bank/Bank.Domain/BankAccount.cs:26:51
     public void Credit(double amount)
     {
         if (amount < 0)
-            throw new ArgumentOutOfRangeException("amount");
+            throw new ArgumentOutOfRangeException("");
         m_balance += amount;
     }
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_WhenAmountIsLessThanZero_ShouldThrowArgumentOutOfRangeException

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
lab-2025-i-si784-u2-05-cs-Daleskadf/Bank/Bank.Domain/BankAccount.cs:27:9
     {
         if (amount < 0)
             throw new ArgumentOutOfRangeException("amount");
-        m_balance += amount;
+        m_balance -= amount;
     }
 }
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_WithValidPositiveAmount_UpdatesBalanceCorrectly; Bank.Domain.Tests.BankAccountTests.Credit_WithValidPositiveAmount_UpdatesBalanceCorrectly
